package org.example.HF_1

//  ключевое слово fun используется для определения функций
// в каждом приложении должна присутствовать функция с именем main
// символы // обозначают однострочный комментарий
// строка (string) представляет собой цепочку символов. Строковые значения заключаются в двойные кавычки
// Программные блоки определяются в паре фигурных скобок { }
// оператор присваивания состоит из одного знака присваивания "="
// оператор проверки равенства состоит из двух знаков равенства "=="
// ключевое слово var определяет переменную, значение которой может изменяться
// ключевое слово val определяет переменную, значение которой остается неизменным
// цикл while выполняет все команды в блоке, пока условие остается истинным(true)
// если условие ложно (false), блок цикла while выполняться не будет, а управление будет передано коду, следующему непосредственно за блоком цикла
// условие заключается в круглые скобки "( )"
// условные проверки в коде определяются ключевыми словами if и else. Секция else не обязательна
// if может использоваться как выражение, возвращающее значение. В этом случае секция else обязательна.