package org.example.HF_3

// функции улучшают структуру кода и упрощают его повторное использование
// функции могут получать параметры - одно или несколько значений
// количество и типы значений, передаваемых функции, должны соответствовать порядку и типу параметров, объявленных функцией
// функция может возвращать значение. Тип этого значения (если оно есть) должен быть объявлен заранее
// возвращаемый тип unit означает, что функция не возвращает никакое значение
// используйте циклы for вместо циклов while, если вам заранее известно, сколько раз должен выполняться код цикла
// функция readline() читает строку ввода из стандартного входного потока. Она возвращает значение String - текст, введённый пользователем
// Если входной потокбыл перенаправлен в файл, то при достижении конца файла функция readline() вернёт null - признак того, что значение отсутствует или не определено
// && означает "И". || означает "ИЛИ". ! означает "НЕ".